src/cf/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<Comment>Расчетная ставка НДС 18/118</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
					<Comment>Расчетная ставка НДС 10/110</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>Расчетная ставка НДС 20/120</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийПоступлениеТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступлениеТоваровУслуг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсновныеСредства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриобретениеЗемельныхУчастков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПокупкаКомиссия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъектыСтроительства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиАренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиЛизинга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиФакторинга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Топливо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/НаправленияРаспознанногоДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>НаправленияРаспознанногоДокумента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентомНаЗакупку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионеромНаЗакупку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СФакторинговойКомпанией</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СТранспортнойКомпанией</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/Склады.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Склады</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment> Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦенРозничнойТорговли</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСклада</Name>
					<Comment> Тип склада: оптовый, розничный, неавтоматизированная торговая точка</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСкладов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/РаспознаваниеДокументовБП/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция СтавкаНДСПоРаспознанномуТексту(Ставка, ТекущееЗначение) Экспорт
	
	Если Ставка = "НДС20" Тогда
		Возврат Перечисления.СтавкиНДС.НДС20;
	ИначеЕсли Ставка = "НДС18" Тогда
		Возврат Перечисления.СтавкиНДС.НДС18;
	ИначеЕсли  Ставка = "НДС10" Тогда
		Возврат Перечисления.СтавкиНДС.НДС10;
	ИначеЕсли Ставка = "НДС18_118" Тогда
		Возврат Перечисления.СтавкиНДС.НДС18_118;
	ИначеЕсли Ставка = "НДС10_110" Тогда
		Возврат Перечисления.СтавкиНДС.НДС10_110;
	ИначеЕсли Ставка = "НДС20_120" Тогда
		Возврат Перечисления.СтавкиНДС.НДС20_120;
	ИначеЕсли Ставка = "НДС0" Тогда
		Возврат Перечисления.СтавкиНДС.НДС0;
	ИначеЕсли Ставка = "БезНДС" Тогда
		Возврат Перечисления.СтавкиНДС.БезНДС;
	КонецЕсли;
	
	Возврат ТекущееЗначение;
	
КонецФункции

Функция ОпределитьСтавкуНДС(Всего, СуммаНДС) Экспорт
	
	Делитель = Всего - СуммаНДС;
	Если Делитель = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	Ставка = Окр(СуммаНДС * 100 / Делитель);
	СтруктураСтавкиНДС = Новый Структура("Числом", Ставка);
	
	Если Ставка = 20 Тогда
		СтавкаСсылкой = Перечисления.СтавкиНДС.НДС20;
	ИначеЕсли Ставка = 18 Тогда
		СтавкаСсылкой = Перечисления.СтавкиНДС.НДС18;
	ИначеЕсли Ставка = 10 Тогда
		СтавкаСсылкой = Перечисления.СтавкиНДС.НДС10;
	ИначеЕсли Ставка = 0 Тогда
		СтавкаСсылкой = Перечисления.СтавкиНДС.БезНДС;
	Иначе
		СтавкаСсылкой = Неопределено;
	КонецЕсли;
	
	Если СтавкаСсылкой = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		СтруктураСтавкиНДС.Вставить("Ссылкой", СтавкаСсылкой);
		Возврат СтруктураСтавкиНДС;
	КонецЕсли;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

#Область ПраваДоступа

// Настраивает в профиле групп доступа роли, предоставляющие право интеграции.
// Описывает соответствующие роли подсистемы.
//
// Параметры:
//  ОписаниеПрофиля - см. УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа() - описание профиля

Процедура РазрешитьИнтеграцию(ОписаниеПрофиля) Экспорт
	
	ОписаниеПрофиля.Роли.Добавить("РаспознаваниеДокументов");
	
КонецПроцедуры

Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Документы.РаспознанныйДокумент, Истина);
	
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьДобавленныеКолонкиТаблиц(Объект, Строки, Очистить = Ложь) Экспорт
	
	ДанныеОбъекта = Новый Структура;
	ДанныеОбъекта.Вставить("Организация", РаспознаваниеДокументовСлужебныйКлиентСервер.ЗначениеРеквизитаДокумента(Объект, РаспознаваниеДокументовСлужебный.ОсновныеРеквизиты(Объект)["Организация"], Справочники.Организации.ПустаяСсылка()));
	ДанныеОбъекта.Вставить("Контрагент", РаспознаваниеДокументовСлужебныйКлиентСервер.ЗначениеРеквизитаДокумента(Объект, РаспознаваниеДокументовСлужебный.ОсновныеРеквизиты(Объект)["Контрагент"], Справочники.Контрагенты.ПустаяСсылка()));
	
	ДанныеОбъекта.Вставить("Дата", РаспознаваниеДокументовСлужебныйКлиентСервер.ЗначениеРеквизитаДокумента(Объект, "ДатаДокумента", '20100101'));
	ДанныеОбъекта.Вставить("Склад", РаспознаваниеДокументовСлужебныйКлиентСервер.ЗначениеРеквизитаДокумента(Объект, "Склад", Справочники.Склады.ПустаяСсылка()));
	ДанныеОбъекта.Вставить("ДоговорКонтрагента", РаспознаваниеДокументовСлужебныйКлиентСервер.ЗначениеРеквизитаДокумента(Объект, "Договор", Справочники.ДоговорыКонтрагентов.ПустаяСсылка()));
	ДанныеОбъекта.Вставить("ВидОперации", Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Товары);
	
	ДанныеОбъекта.Вставить("ПодразделениеОрганизации", Неопределено);
	
	СтрокиТовары = Новый Массив;
	СтрокиУслуги = Новый Массив;
	
	Если ТипЗнч(Строки) = Тип("ДанныеФормыКоллекция") Тогда
		СписокНоменклатур = Строки.Выгрузить(, "Номенклатура").ВыгрузитьКолонку("Номенклатура");
	ИначеЕсли ТипЗнч(Строки) = Тип("ТаблицаЗначений") Тогда
		СписокНоменклатур = Строки.ВыгрузитьКолонку("Номенклатура");
	ИначеЕсли ТипЗнч(Строки) = Тип("Массив") Тогда
		СписокНоменклатур = Новый Массив;
		Для Каждого СтрокаМассива из Строки Цикл
			Если ТипЗнч(СтрокаМассива) = Тип("ДанныеФормыЭлементКоллекции") И СтрокаМассива.Свойство("Номенклатура") тогда
				СписокНоменклатур.Добавить(СтрокаМассива.Номенклатура);
			КонецЕсли;
		КонецЦикла;
	Иначе
		СписокНоменклатур = Новый Массив;
	КонецЕсли;
	
	СписокУслугиПоНоменклатурам = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(СписокНоменклатур, "Услуга");
	
	Для каждого СтрокаТаблицы Из Строки Цикл
		Если Очистить Тогда
			ОчиститьДобавленныеКолонкиСтрокиТаблицыТовары(СтрокаТаблицы);
		КонецЕсли;
		
		ЭтоУслуга = СписокУслугиПоНоменклатурам.Получить(СтрокаТаблицы.Номенклатура);
		Если ЭтоУслуга = Неопределено Тогда
			ЭтоУслуга = Ложь;
		КонецЕсли;
		
		Если ЭтоУслуга Тогда
			СтрокиУслуги.Добавить(СтрокаТаблицы);
		Иначе
			СтрокиТовары.Добавить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	
	Если Объект.Направление = Перечисления.НаправленияРаспознанногоДокумента.Исходящий Тогда
		СчетаУчетаВДокументах.ЗаполнитьСтроки(СтрокиТовары, "Товары", ДанныеОбъекта, Документы.РеализацияТоваровУслуг);
		СчетаУчетаВДокументах.ЗаполнитьСтроки(СтрокиУслуги, "Услуги", ДанныеОбъекта, Документы.РеализацияТоваровУслуг);
	Иначе
		СчетаУчетаВДокументах.ЗаполнитьСтроки(СтрокиТовары, "Товары", ДанныеОбъекта, Документы.ПоступлениеТоваровУслуг);
		СчетаУчетаВДокументах.ЗаполнитьСтроки(СтрокиУслуги, "Услуги", ДанныеОбъекта, Документы.ПоступлениеТоваровУслуг);
	КонецЕсли;
	
	ЗаполнениеОтражениеВУСН(ДанныеОбъекта, Строки);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПрограммныйИнтерфейс

Процедура ОчиститьДобавленныеКолонкиСтрокиТаблицыТовары(СтрокаТабличнойЧасти)
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("СчетУчета", Неопределено);
	ДанныеЗаполнения.Вставить("СчетДоходов", Неопределено);
	ДанныеЗаполнения.Вставить("Субконто", Неопределено);
	ДанныеЗаполнения.Вставить("СчетРасходов", Неопределено);
	ДанныеЗаполнения.Вставить("СчетУчетаНДСПоРеализации", Неопределено);
	ДанныеЗаполнения.Вставить("ПереданныеСчетУчета", Неопределено);
	ДанныеЗаполнения.Вставить("СчетУчетаНДС", Неопределено);
	ДанныеЗаполнения.Вставить("СчетРасчетов", Неопределено);
	ДанныеЗаполнения.Вставить("СпособУчетаНДС", Неопределено);
	ДанныеЗаполнения.Вставить("ОтражениеВУСН", Неопределено);
	ДанныеЗаполнения.Вставить("СчетЗатрат", Неопределено);
	ДанныеЗаполнения.Вставить("ПодразделениеЗатрат", Неопределено);
	ДанныеЗаполнения.Вставить("Субконто1", Неопределено);
	ДанныеЗаполнения.Вставить("Субконто2", Неопределено);
	ДанныеЗаполнения.Вставить("Субконто3", Неопределено);
	ДанныеЗаполнения.Вставить("СчетЗатратНУ", Неопределено);
	ДанныеЗаполнения.Вставить("СубконтоНУ1", Неопределено);
	ДанныеЗаполнения.Вставить("СубконтоНУ2", Неопределено);
	ДанныеЗаполнения.Вставить("СубконтоНУ3", Неопределено);
	ДанныеЗаполнения.Вставить("Контрагент", Неопределено);
	ДанныеЗаполнения.Вставить("ДоговорКонтрагента", Неопределено);
	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ДанныеЗаполнения)
	
КонецПроцедуры

Процедура ЗаполнениеОтражениеВУСН(Объект, ТабличнаяЧасть)
	
	Если УчетнаяПолитика.Существует(Объект.Организация, Объект.Дата) Тогда
		
		ДоговорУказан = ЗначениеЗаполнено(Объект.ДоговорКонтрагента);
		РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ДоговорКонтрагента, "ВидДоговора");
		ЭтоКомиссия = ДоговорУказан И РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом;
		
		ВариантОтраженияУСН = ПоступлениеТоваровУслугФормыКлиентСервер.ОтражениеВУСН(Объект.ВидОперации, ЭтоКомиссия);
		
		// Заполняем отражение в УСН для ТЧ
		Для Каждого СтрокаТаблицы Из ТабличнаяЧасть Цикл
			СтрокаТаблицы.ОтражениеВУСН = ВариантОтраженияУСН;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
